{
  "name": "default_quality_dataset_v1",
  "version": 1,
  "categories": {
    "rust": {
      "items": [
        "Rust is a systems programming language focused on memory safety and performance",
        "Ownership and borrowing rules prevent data races in Rust",
        "Lifetimes in Rust ensure references are always valid",
        "Cargo is Rust's package manager and build tool",
        "Crates are Rust packages managed via Cargo and crates.io",
        "Tokio provides an async runtime for Rust applications",
        "Traits enable polymorphism and shared behavior in Rust",
        "Pattern matching with match is idiomatic in Rust",
        "Clippy is a Rust linter that catches common mistakes",
        "Serde helps serialize and deserialize Rust data structures",
        "The borrow checker enforces safe aliasing rules",
        "Macros in Rust enable powerful code generation"
      ],
      "queries": [
        "What are Rust unique features for memory safety?",
        "Which tool manages Rust dependencies?",
        "What is the async runtime commonly used in Rust?",
        "How does borrowing and ownership help safety in Rust?",
        "Which linter is popular for Rust code?",
        "How are Rust packages organized and distributed?"
      ]
    },
    "python": {
      "items": [
        "Python is a high-level programming language with dynamic typing",
        "Pip installs and manages Python packages",
        "Virtualenv creates isolated Python environments",
        "Asyncio provides asynchronous IO primitives in Python",
        "Type hints improve readability and tooling for Python code",
        "Pandas is a Python library for data analysis",
        "NumPy provides fast arrays and vectorized operations",
        "PyPI hosts Python packages for distribution",
        "Black formats Python code to a consistent style",
        "pytest is a simple yet powerful Python testing framework",
        "uvloop can speed up asyncio event loop",
        "Poetry helps manage dependencies and packaging"
      ],
      "queries": [
        "How to manage Python packages?",
        "What library helps with dataframes in Python?",
        "What are virtual environments used for in Python?",
        "Which module provides async IO in Python?",
        "What tool formats Python code consistently?",
        "Which site hosts public Python packages?"
      ]
    },
    "ml": {
      "items": [
        "Gradient descent optimizes neural networks by minimizing loss",
        "Overfitting occurs when a model memorizes training data",
        "Cross-validation helps estimate generalization performance",
        "Learning rate controls the optimization step size",
        "Regularization reduces model complexity and prevents overfitting",
        "Batch normalization stabilizes and accelerates training",
        "Early stopping halts training when validation loss worsens",
        "Dropout randomly disables neurons to reduce overfitting",
        "Adam optimizer adapts learning rates per parameter",
        "Weight decay encourages smaller weights via L2 penalty",
        "Data augmentation improves robustness by altering samples",
        "Hyperparameter tuning searches for better model settings"
      ],
      "queries": [
        "How to prevent overfitting?",
        "What method adjusts step size in optimization?",
        "Why use cross validation in ML?",
        "What does batch normalization help with?",
        "Which optimizer adapts learning rates per parameter?",
        "How can augmentation improve robustness?"
      ]
    },
    "cooking": {
      "items": [
        "Boil pasta in salted water until al dente",
        "Saute onions and garlic in olive oil",
        "Simmer tomato sauce with basil and oregano",
        "Bake bread at high temperature for a crispy crust",
        "Whisk eggs and sugar until fluffy for sponge cake",
        "Grill vegetables to add a smoky flavor",
        "Let steak rest to retain juices before slicing",
        "Use a thermometer to cook meat to safe temperature",
        "Bloom gelatin in cold water before dissolving",
        "Proof yeast in warm water with sugar",
        "Deglaze pan with wine to make a sauce",
        "Season to taste with salt and pepper"
      ],
      "queries": [
        "How to cook spaghetti properly?",
        "What gives bread a crispy crust?",
        "How to saute onions correctly?",
        "How to make a simple tomato sauce?",
        "Why rest steak after cooking?",
        "How to ensure meat is cooked safely?"
      ]
    },
    "travel": {
      "items": [
        "Japan offers beautiful temples and gardens to visit",
        "Use a rail pass for efficient train travel in Japan",
        "Pack light for international flights to move easily",
        "Local cuisine is a key part of travel experiences",
        "Hostels are budget-friendly accommodations for travelers",
        "Consider travel insurance for emergencies and cancellations",
        "Check visa requirements before booking travel",
        "Carry a universal power adapter for your electronics",
        "Learn a few local phrases to be polite",
        "Keep copies of important documents when abroad",
        "Use packing cubes to organize luggage",
        "Notify your bank of international travel to avoid card blocks"
      ],
      "queries": [
        "Advice for trains in Japan?",
        "How to travel light on flights?",
        "Why consider travel insurance?",
        "Tips for budget accommodations when traveling?",
        "What to check before traveling abroad?",
        "How to prepare electronics for international trips?"
      ]
    },
    "devops": {
      "items": [
        "CI/CD automates build, test, and deployment pipelines",
        "Docker packages apps into portable containers",
        "Kubernetes orchestrates containerized workloads",
        "Infrastructure as Code manages infra declaratively",
        "Terraform provisions cloud resources reproducibly",
        "Prometheus collects metrics for monitoring",
        "Grafana visualizes time-series dashboards",
        "Blue-green deployments reduce downtime",
        "Canary releases limit blast radius of issues",
        "GitOps applies pull‑request workflows to infrastructure",
        "Service meshes add observability and traffic control",
        "SRE practices focus on reliability and SLIs/SLOs"
      ],
      "queries": [
        "What orchestrates containers in production?",
        "How to declare and provision infrastructure reproducibly?",
        "Which system collects metrics for monitoring?",
        "What is CI/CD used for?",
        "What enables safe progressive delivery?",
        "What is the purpose of a service mesh?"
      ]
    },
    "databases": {
      "items": [
        "SQL databases support ACID transactions",
        "Indexes speed up queries by optimizing lookups",
        "Isolation levels control read phenomena in transactions",
        "NoSQL databases trade consistency for availability in some models",
        "Sharding distributes data across multiple nodes",
        "Replication improves availability and read scalability",
        "Primary keys uniquely identify rows in a table",
        "Foreign keys enforce referential integrity",
        "Materialized views cache results of complex queries",
        "Query planners optimize execution strategies",
        "OLTP handles transactional workloads",
        "OLAP supports analytical queries"
      ],
      "queries": [
        "What do ACID properties ensure in databases?",
        "How do indexes help query performance?",
        "What are common transaction isolation levels?",
        "When is sharding used?",
        "What does replication improve?",
        "What is the role of a foreign key?"
      ]
    },
    "security": {
      "items": [
        "TLS encrypts data in transit between client and server",
        "Encryption at rest protects stored data from theft",
        "Hashing with salt secures stored passwords",
        "XSS attacks inject malicious scripts into web pages",
        "SQL injection exploits unsanitized inputs",
        "Threat modeling identifies and mitigates risks",
        "Least privilege limits permissions to what is necessary",
        "MFA requires multiple authentication factors",
        "Input validation prevents many common attacks",
        "Secure defaults reduce misconfiguration risks",
        "CSRF attacks trick users into unwanted actions",
        "Content Security Policy helps mitigate XSS"
      ],
      "queries": [
        "How to protect data in transit?",
        "What protects data at rest?",
        "How to store passwords securely?",
        "What is XSS and how to mitigate it?",
        "What prevents SQL injection?",
        "Why use least privilege and MFA?"
      ]
    }
  }
}

